tests/com/l7tech/service/resources/ibmEttkSignedRequest.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <soapenv:Header>
    <wsse:Security soapenv:mustUnderstand="1" xmlns:wsse="http://schemas.xmlsoap.org/ws/2002/07/secext">
      <wsse:BinarySecurityToken EncodingType="wsse:Base64Binary" ValueType="wsse:X509v3" wsu:Id="wssecurity_binary_security_token_id_83887585640487474_1088636071891" xmlns:wsu="http://schemas.xmlsoap.org/ws/2002/07/utility">
        MIICazCCAdSgAwIBAgIEPb7rVDANBgkqhkiG9w0BAQQFADB6MRMwEQYDVQQDDApKb2huIFNtaXRo
        MR8wHQYDVQQLDBZKYXZhIFRlY2hub2xvZ3kgQ2VudGVyMQwwCgYDVQQKDANJQk0xEjAQBgNVBAcM
        CUN1cGVydGlubzETMBEGA1UECAwKQ2FsaWZvcm5pYTELMAkGA1UEBhMCVVMwHhcNMDUwMTAxMDAw
        MDAwWhcNMjUxMjMxMjM1OTU5WjB6MRMwEQYDVQQDDApKb2huIFNtaXRoMR8wHQYDVQQLDBZKYXZh
        IFRlY2hub2xvZ3kgQ2VudGVyMQwwCgYDVQQKDANJQk0xEjAQBgNVBAcMCUN1cGVydGlubzETMBEG
        A1UECAwKQ2FsaWZvcm5pYTELMAkGA1UEBhMCVVMwgZ8wDQYJKoZIhvcNAQEBBQADgY0AMIGJAoGB
        AK2K2KzkU42+/bfpfDUIo68oA5DQ1iW9F38UrC5/5PVcIVp0cyu28eGr/5n8OVyfZhBg4Kn1q5L5
        aQFwvQBSskk9RvBkgHYLIFkmOdLv6N1vftEphBSw1E2WB0hyhkzxu8JmV0FJ+dq3jEM/JA4kHsTE
        OsyYj20/Q1j0Y3Sel+fDAgMBAAEwDQYJKoZIhvcNAQEEBQADgYEAiA+65PCTbLfkB7OLz5OEQUwy
        SoK16nTY3cXKGrq1rWdHAYmr+FfVF+1ePicihDMVqfzZHeHMlNAvjVRliwP4HuU58OMz3Jn+8iJ0
        exKH9EKgfFZ7csX7cyXtZfvaMTxlAca04muonxJS0FFqxSFgJNScQELaA6R82wse0hksr7o=
      </wsse:BinarySecurityToken>
      <Signature xmlns="http://www.w3.org/2000/09/xmldsig#">
        <SignedInfo>
          <CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
          <SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/>
          <Reference URI="#wssecurity_body_id_513048314477033528_1088636071891">
            <Transforms>
              <Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
            </Transforms>
            <DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
            <DigestValue>sDz0UHsV12F267jlEZijGOX0l/8=</DigestValue>
          </Reference>
          <Reference URI="#tsc_8403499464478784195_1088636071891">
            <Transforms>
              <Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
            </Transforms>
            <DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
            <DigestValue>tqa7LkKCwKyO/QeRFFtvV2Pp3Pw=</DigestValue>
          </Reference>
          <Reference URI="#tse_3308692968300561793_1088636071891">
            <Transforms>
              <Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
            </Transforms>
            <DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
            <DigestValue>z9UobQOmE4+Dua1jzbOgsxVp2M0=</DigestValue>
          </Reference>
        </SignedInfo>
        <SignatureValue>
          Wwqz/a0d1GDnCmiC6vPGSr46ZSfol6HjRduryCC9SP4Sfn/3GYS4/TU5MDAxI0rsz1
          BIh/mSa2ohnaZ8Cc1bgARKpDnSGKD+DA8i+9edWb4UzgH5M9JJBp5FD9Z8WpTFAa5c
          okz26tQVJZmx6zGMQIBfnWL57LrHreD4BygB92Y=
        </SignatureValue>
        <KeyInfo>
          <wsse:SecurityTokenReference>
            <wsse:Reference URI="#wssecurity_binary_security_token_id_83887585640487474_1088636071891"/>
          </wsse:SecurityTokenReference>
        </KeyInfo>
      </Signature>
    </wsse:Security>
    <wsu:Timestamp xmlns:wsu="http://schemas.xmlsoap.org/ws/2002/07/utility">
      <wsu:Created wsu:Id="tsc_8403499464478784195_1088636071891">2004-06-30T22:54:31Z</wsu:Created>
      <wsu:Expires wsu:Id="tse_3308692968300561793_1088636071891">2004-07-30T22:54:31Z</wsu:Expires>
    </wsu:Timestamp>
  </soapenv:Header>
 <soapenv:Body wsu:Id="wssecurity_body_id_513048314477033528_1088636071891" xmlns:wsu="http://schemas.xmlsoap.org/ws/2002/07/utility">
  <ns1:getQuote soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xmlns:ns1="urn:xmltoday-delayed-quotes">
   <symbol xsi:type="xsd:string">XXX</symbol>
  </ns1:getQuote>
 </soapenv:Body>
</soapenv:Envelope>
